[
    "A new study shows that the insects change their aggressive behavior when they know other crickets are watching, the first time this phenomenon has been observed in any invertebrate. Mammals, birds, and fish are all known to be influenced by others. In recent experiments, male crickets fighting in an arena acted more violently—and upon winning, were more jubilant—when other male or female crickets were in the audience.",
    "Insects called crickets but not of the cricket family Gryllidae include the camel cricket, Jerusalem cricket, mole cricket, and pygmy sand cricket.",
    "Crickets sing an impressive variety of songs, each with its own purpose. A male’s calling song invites receptive females to come closer and get to know him. He then serenades the female with his courthship song, trying to convince her that he is the best among her suitors. If she accepts him as a mate, he may sing a song to announce their partnership. Male crickets also sing rivalry songs to defend their territories from competitors. Each cricket species produces its own signature call, with a unique volume and pitch.",
    "Thanks to the demand created by reptile owners and breeders, cricket-breeding is a multimillion dollar business in the U.S. Large scale cricket breeders may raise as many as 50 million crickets at a time in warehouse-sized facilities.",
    "To hear the mating call of other crickets, a cricket has ears located on its knees, just below the joint of the front legs.",
    "Crickets produce sound by stridulating, or rubbing body parts together. The male cricket has a vein at the base of his forewings that acts as a file or scraper. To sing, he pulls this ridged vein against the upper surface of the opposite wing, causing a vibration amplified by the thin membrane of the wing.",
    "Size of crickets depends on the species. They are usually 1 to 2 inches long.",
    "Crickets can be black, red, brown or green in color.",
    "Most species of crickets have flattened body and two pairs of membranous wings.",
    "Crickets have one pair of one inch long antennas, called feelers. Antennas can detect movement of the prey and facilitate finding of food.",
    "Crickets have excellent eyesight. Their eyes (known as compound eyes) consist of large number of lenses which ensure visualization of different pictures at the same time.",
    "Intensity of chirps depends on the temperature. Outer temperature (in Fahrenheit degrees) can be determined by adding 37 to the number of chirps produced in 15 seconds. Higher temperature is associated with more frequent chirps.",
    "Most species of crickets live on the ground, but some of them live under the ground, inside the caves, or high on the trees.",
    "Even though crickets have wings, they do not fly. Crickets can jump or travel short distances by producing jerky moves.",
    "Crickets are active during the night (nocturnal creatures).",
    "Crickets are omnivores (eat plants and other animals). Their diet includes various types of insects, fungi and plant materials.",
    "Frogs, lizards, turtles and large spiders are main predators of crickets. These cute insects are also consumed as delicacy in certain parts of Asia.",
    "Crickets lay eggs in autumn. Eggs remain incubated during the cold winter period and hatch at the beginning of spring. Crickets have incomplete metamorphosis which consists of three developmental stages: egg, nymph and adult insect.",
    "Crickets molt as they grow. Young insects look like miniature version of adults.",
    "Crickets do not have long lifespan. They can survive up to one year in the wild.",
    "The word cricket comes from the Old French word criquet, and refers to the cricket’s song—people once thought that those repeated chirps sounded like “criquet … criquet … criquet.” Interestingly, the name for the sport of cricket has a totally different origin: it comes from an Old French word for goal post.",
    "Crickets have a cosmopolitan distribution, being found in all parts of the world with the exception of cold regions at latitudes higher than about 55° North and South.",
    "Crickets develop by incomplete metamorphosis, a process in which the larvae resembles the adults somewhat, as they have compound eyes, developed legs, and wing stubs visible on the outside, but the juvenile forms are smaller and if the adult has wings, lack wings. In this mode of development, which involves gradual change, there are three distinct stages: the egg, nymph, and the adult stage, or imago. There is no pupal stage characteristic of complete metamorphosis.",
    "The folklore and mythology surrounding crickets is extensive. The singing of crickets in the folklore of Brazil and elsewhere is sometimes taken to be a sign of impending rain, or of a financial windfall.",
    "Crickets are usually found in summer season. They live in a number of places. These may include—scrub forests, fields, plants, caves, trees, dark and humid areas, pastures, yard debris, under or over the ground and under the rocks.",
    "I͈̤̮͈̱̫ͩ ̩̮̟̞̣͕ͩ̐̂͐͛ͅd̳̻̦̩͎͍̔ͣ̊ͩ̇o͈̰̫̠͙͕ͤ͂͌̎ͣ͂̇n̰͍̓̒̓̈́'̺̠̫ͥ͌̿̒t̞̞̣͇̙́̈̒ͨ ̦̤̟͎͋ͩͦ̃l̪̞̟ĩ͎̊̎̾k͈̘̘̭͉͈̺e̦̦ͤ̎̇̿ ̼̈́ͥc̲̺̺̩̠̼̙ͤ͋̐r̫̩̞͔͎͐ͭͮ̆͗̃͂ị͎̙͖̞͓̲́̋̽̇ͬ͐͌c̳̱̪̖͔̬̼̄̽̈́̎͑́̽k̲ͮ͒͛ͨȅ̥t͑ͮ̈͋"
]
